In [1]:
import pandas as pd
import numpy as np

In [3]:
# both row and col index
# row index is index, col index is coumns
df = pd.DataFrame(np.arange(12).reshape(3,4))

In [4]:
df.columns = ["sem1" , "sem2" , "sem3" , "sem4"]
df.index = ["Math" , "Science" , "SST"]
df

         sem1  sem2  sem3  sem4
Math        0     1     2     3
Science     4     5     6     7
SST         8     9    10    11

In [6]:
# ulta h thoda
print(df.mean()) # col wise means
print(df.mean(axis=1)) # row wise meansw

sem1    4.0
sem2    5.0
sem3    6.0
sem4    7.0
dtype: float64
Math       1.5
Science    5.5
SST        9.5
dtype: float64

In [9]:
# Create Df
# way 1
ppl = pd.DataFrame({ "names" : ["Aryan" , "Jack" , "Queent"] , "Age" : [40,34,33]  }, index = ["a","b","c"])

In [13]:
pd.DataFrame({ "name" : ["Aryan" , "Jack" , "Queent"] , "age" : [40,34,33]  },  columns=["age" , "name" , "major"])

   age    name major
0   40   Aryan   NaN
1   34    Jack   NaN
2   33  Queent   NaN

In [14]:
print(ppl.index)
print(ppl.columns)

Index(['a', 'b', 'c'], dtype='object')
Index(['names', 'Age'], dtype='object')

In [17]:
ppl.names

a     Aryan
b      Jack
c    Queent
Name: names, dtype: object

In [18]:
ppl.Age

a    40
b    34
c    33
Name: Age, dtype: int64

In [23]:
ppl.loc["c"] # serie like
ppl.loc[["c"]] #df

    names  Age
c  Queent   33

In [30]:
ppl["major"] = [ "CS" , "Math" , "Bio"] # or single val
ppl

    names  Age major
a   Aryan   40    CS
b    Jack   34  Math
c  Queent   33   Bio

In [35]:
ppl[((ppl["major"] == "CS")| (ppl["names"] == "Queent"))]

    names  Age major
a   Aryan   40    CS
c  Queent   33   Bio

In [38]:
ppl["old"] = ppl["Age"] > 33
ppl.columns = ["name" , "age" , "major" , "is_old"]
ppl

     name  age major  is_old
a   Aryan   40    CS    True
b    Jack   34  Math    True
c  Queent   33   Bio   False

In [40]:
del ppl["is_old"]
ppl

     name  age major
a   Aryan   40    CS
b    Jack   34  Math
c  Queent   33   Bio

In [44]:
# way 2 nested diK inner indices -> row
df3 = pd.DataFrame({ 
    "names" : { "a" : "Aryan" , "b" : "Anika" },
    "marks" : { "a" : 30, "b" : 20 , "c" : 20 }
})
df3

   names  marks
a  Aryan     30
b  Anika     20
c    NaN     20

In [43]:
df3.T

           a      b    c
names  Aryan  Anika  NaN
marks     30     20   20

In [47]:
# naming col and row indices
df3.index.name = "row"
df3.columns.name = "Subs"
df3

Subs  names  marks
row
a     Aryan     30
b     Anika     20
c       NaN     20

In [48]:
df3.values

array([['Aryan', 30],
       ['Anika', 20],
       [nan, 20]], dtype=object)

In [49]:
# Index object -> immutable
o1 = pd.Series(range(4) , index = ["a" , "b" , "C" , "d"])
o1.index

Index(['a', 'b', 'C', 'd'], dtype='object')

In [50]:
o1.index[2:]

Index(['C', 'd'], dtype='object')

In [51]:
labs = pd.Index(range(4))
labs

RangeIndex(start=0, stop=4, step=1)

In [52]:
"major" in df3.columns

False

In [53]:
4 in df3.index

False